# BendDiameterDimensionsForHooksEnabled Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBendingDetailType..::..BendDiameterDimensionsForHooksEnabled Property
RebarBendingDetailType Class See Also
---
Identifies if radial or diameter dimensions will be shown for hook fillets. This property has a meaning only if BendDiameterDimensionsEnabled is set to true.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public bool BendDiameterDimensionsForHooksEnabled { get; set; }
```

Visual Basic
---
```text
Public Property BendDiameterDimensionsForHooksEnabled As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool BendDiameterDimensionsForHooksEnabled {
	bool get ();
	void set (bool value);
}
```

# See Also
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace